---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.TopRailType
source: html/023e3abe-bc7b-0c5b-14c8-0b6c098e3b55.htm
---
# TopRailType Properties

The id of the assembly instance to which the element belongs.